{
    "<PAD>": 0,
    "<UNK>": 1,
    "program": 2,
    "class_declaration": 3,
    "modifiers": 4,
    "name:": 5,
    "identifier": 6,
    "body:": 7,
    "class_body": 8,
    "method_declaration": 9,
    "type:": 10,
    "void_type": 11,
    "parameters:": 12,
    "formal_parameters": 13,
    "block": 14,
    "for_statement": 15,
    "init:": 16,
    "local_variable_declaration": 17,
    "integral_type": 18,
    "declarator:": 19,
    "variable_declarator": 20,
    "value:": 21,
    "decimal_integer_literal": 22,
    "condition:": 23,
    "binary_expression": 24,
    "left:": 25,
    "right:": 26,
    "update:": 27,
    "update_expression": 28,
    "expression_statement": 29,
    "method_invocation": 30,
    "object:": 31,
    "field_access": 32,
    "field:": 33,
    "arguments:": 34,
    "argument_list": 35,
    "string_literal": 36,
    "string_fragment": 37,
    "parenthesized_expression": 38,
    "formal_parameter": 39,
    "array_type": 40,
    "element:": 41,
    "type_identifier": 42,
    "dimensions:": 43,
    "dimensions": 44,
    "static_initializer": 45,
    "assignment_expression": 46,
    "block_comment": 47,
    "import_declaration": 48,
    "scoped_identifier": 49,
    "scope:": 50,
    "throws": 51,
    "array_initializer": 52,
    "array_access": 53,
    "array:": 54,
    "index:": 55,
    "escape_sequence": 56,
    "spread_parameter": 57,
    "array_creation_expression": 58,
    "dimensions_expr": 59,
    "line_comment": 60,
    "MISSING": 61,
    "\"}\"": 62,
    "character_literal": 63,
    "lambda_expression": 64,
    "asterisk": 65,
    "ERROR": 66,
    "field_declaration": 67,
    "object_creation_expression": 68,
    "return_statement": 69,
    "if_statement": 70,
    "consequence:": 71,
    "boolean_type": 72,
    "false": 73,
    "true": 74,
    "generic_type": 75,
    "type_arguments": 76,
    "while_statement": 77,
    "cast_expression": 78,
    "enhanced_for_statement": 79,
    "break_statement": 80,
    "UNEXPECTED": 81,
    "'#'": 82,
    "type_parameters": 83,
    "type_parameter": 84,
    "unary_expression": 85,
    "operand:": 86,
    "method_reference": 87,
    "continue_statement": 88,
    "package_declaration": 89,
    "scoped_type_identifier": 90,
    "12288": 91,
    "constructor_declaration": 92,
    "constructor_body": 93,
    "type_arguments:": 94,
    "\";\"": 95,
    "try_with_resources_statement": 96,
    "resources:": 97,
    "resource_specification": 98,
    "resource": 99,
    "catch_clause": 100,
    "catch_formal_parameter": 101,
    "catch_type": 102,
    "alternative:": 103,
    "underscore_pattern": 104,
    "this": 105,
    "do_statement": 106,
    "try_statement": 107,
    "176": 108,
    "interface_declaration": 109,
    "interface_body": 110,
    "interfaces:": 111,
    "super_interfaces": 112,
    "type_list": 113,
    "'n'": 114,
    "superclass:": 115,
    "superclass": 116,
    "explicit_constructor_invocation": 117,
    "constructor:": 118,
    "super": 119,
    "marker_annotation": 120,
    "class_literal": 121,
    "null_literal": 122,
    "\"": 123,
    "floating_point_type": 124,
    "ternary_expression": 125,
    "128": 126,
    "throw_statement": 127,
    "enum_declaration": 128,
    "enum_body": 129,
    "enum_constant": 130,
    "enum_body_declarations": 131,
    "octal_integer_literal": 132,
    "template_expression": 133,
    "template_processor:": 134,
    "template_argument:": 135,
    "decimal_floating_point_literal": 136,
    "12290": 137,
    "inferred_parameters": 138,
    "type_parameters:": 139,
    "annotation": 140,
    "annotation_argument_list": 141
}